app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "description", "text", "deadline", "priority", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "deadline" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["deadline", 2022-01-01 00:00:00 UTC], ["updated_at", 2017-01-12 13:03:29 UTC], ["id", 1]]